Tekla.Structures.Model.Messages
A static class where common messages is to be added

Tekla.Structures.Model.Messages.PartGeometryImportFailed
Error message from class Tekla.Structures.ModelInternal.GeometryExporter

Tekla.Structures.Model.Messages.PartGeometryExportFailed
Error message from class Tekla.Structures.ModelInternal.GeometryExporter

Tekla.Structures.Model.Messages.InvalidNumberOfPoints
Error message from class Tekla.Structures.Model.ConnectiveGeometry

Tekla.Structures.Model.Messages.ExtensionIntersectsWithPlate
Extension plate clashes with plates.

Tekla.Structures.Model.Messages.FacesTooNearEachOther
Faces to be connected overlap.

Tekla.Structures.Model.Messages.FacePerpendicularToIntersectionLine
Face perpendicular to intersection line.

Tekla.Structures.Model.Messages.FacesAtAnObtuseAngle
Faces to be connected are too steep of an angle.

Tekla.Structures.Model.Messages.UndefinedCurveDirection
Can't make inward/outward curve check.

Tekla.Structures.Model.Messages.PlateIntersectsWithIntersectionLine
Plate polygon extends beyond intersection line.

Tekla.Structures.Model.Messages.UnsupportedChamfer
Plates containing unsupported chamfer information.

Tekla.Structures.Model.Messages.InvalidRadius
Cannot connect parts with a cylindrical section having the provided radius.

Tekla.Structures.Model.Messages.InvalidFacePoints
Cannot create geometry from requested face points.

Tekla.Structures.Model.Messages.GeneralConnectiveGeometryFailure
General failure mode.

Tekla.Structures.Model.Messages.SpiralBeamDefinitionPointsTooClose
Spiral beam definition points are too close.

Tekla.Structures.Model.Messages.SpiralBeamDefinitionPointsCannotBeAligned
Spiral beam definition points are on line with sweep direction.

Tekla.Structures.Model.Messages.SpiralBeamZeroTotalRiseWithMore360Degrees
Spiral beam total rise is zero and rotation angle more than 360 degrees.

Tekla.Structures.Model.Messages.SpiralBeamRotationAngleIs0Degrees
Spiral beam rotation angle is 0 degrees.

Tekla.Structures.Model.Messages.SpiralBeamInvalidGeometry
Spiral beam has invalid geometry.